Revit 2026 API

# DocumentEquals Method

---

Determines whether the specified Object equals to this Object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override bool Equals(
	Object obj
)
```
```vb
Public Overrides Function Equals (
	obj As Object
) As Boolean
```
```cpp
public:
virtual bool Equals(
	Object^ obj
) override
```
```fsharp
abstract Equals :
        obj : Object -> bool
override Equals :
        obj : Object -> bool
```

#### Parameters

obj Object

#### Return Value

Boolean

Two document instances are considered equal if they represent the same document currently opened in the Revit session.

#### Reference

Document Class

Autodesk.Revit.DB Namespace